"""Дана строка data. Разбить строку на группы по 3 числа
и посчитать суммы каждого первого, второго и третьего.
Пример :
0.00002640 + 0.00002599 + 0.21919999 + ...
23174.4902 + 8434.0130 + 52622.1944 + …
0.61180654 + 0.21919999 + 1.05244388 + ...
"""


if __name__ == '__main__':
    data = """
    0.00002640
    23174.4902
    0.61180654
    0.00002599
    8434.0130
    0.21919999
    0.00002000
    52622.1944
    1.05244388
    0.00001599
    13708.5678
    0.21919999
    0.00001500
    100232.3673
    1.50348550
    """
    numbers = []
    for i in data.split():
        numbers.append(float(i))
    print('The first sum', sum(numbers[::3]))
    print('The second sum', sum(numbers[1::3]))
    print('The third sum', sum(numbers[2::3]))
